{"pageProps":{"frontMatter":{"title":"Personal Effectiveness – 10 Rules for Productivity","date":"2024-04-16","summary":"After spending more than a decade in consulting building, leading and growing a multi-national team, I share my experience with personal productivity through 10 key principles."},"html":"\n<h1 class=\"text-4xl font-bold mb-6\">Personal Effectiveness – 10 Rules for Productivity</h1>\n\n<p class=\"mb-4 leading-relaxed text-gray-800\"><em>Published: Apr 16</em></p>\n\n<p class=\"mb-4 leading-relaxed text-gray-800\">After spending more than a decade in consulting building, leading and growing a multi-national team, I have some experience with personal productivity. While I am certainly no master – and have not achieved everything here perfectly all the time – I have observed certain patterns in myself and in others and have found these things to work in most circumstances. I write the following in the hope that it will be useful to someone.</p>\n\n<p class=\"mb-4 leading-relaxed text-gray-800\">I hasten to add, however, that there is no recipe for personal productivity just as there is no recipe for how to raise kids. Each case is different. Experimentation to discover what actually works for you in being productive is essential – just as every parent must adapt to the personality of each child. However, just as there are good ways and bad ways to raise a child, there are ways to be more productive that generally work.</p>\n\n<h2 class=\"text-2xl font-semibold mt-8 mb-4\">Know where you are headed</h2>\n\n<p class=\"mb-4 leading-relaxed text-gray-800\">Productivity without clear goals is just spinning the wheels. They do not always have to be explicit — sometimes they emerge, and that's fine. But I have found it is easier when you have written them down. Setting the right goals is critical. Focus on your responsibilities before your ambitions. If you don't have a destination, pick one that's in the right direction and use it as a proxy — that is fine too! Goals change often — but not too often (the frequency it takes to train for a marathon feels about the minimum).</p>\n\n<hr class=\"my-8 border-t border-gray-200\" />\n\n<h2 class=\"text-2xl font-semibold mt-8 mb-4\">Principle 1: Progress is measured in miles, not feet</h2>\n\n<p class=\"mb-4 leading-relaxed text-gray-800\">Ultimately your productivity should always be measured as progress toward these goals — large, long-term, dial-moving achievements. Enjoy the feeling of ticking off the to-do list (it can be a daily indulgence – and do certainly indulge to find daily motivation) but always come back here. This is what matters. Don't sweat the small stuff.</p>\n\n<h2 class=\"text-2xl font-semibold mt-8 mb-4\">Principle 2: Focus on the next tree</h2>\n\n<p class=\"mb-4 leading-relaxed text-gray-800\">Keep your head down and focus on the next tree. Like the long-distance runner — that's how you conquer the marathon. When the day is clear and you are feeling strong, that tree may be many miles away (the final destination even), but in moments of weakness on a rainy day, it may just be the next step. All are fine. Set your goals where they feel right, not further.</p>\n\n<h2 class=\"text-2xl font-semibold mt-8 mb-4\">Principle 3: Have stretch goals</h2>\n\n<p class=\"mb-4 leading-relaxed text-gray-800\">Most people overestimate how much they can do in 10 years and underestimate how much they can do in 1 year. Wisdom from Bill Gates. Be pessimistic in the short term about what you can do, but optimistic in the long term. (This does not just go for goal setting, by the way.)</p>\n\n<h2 class=\"text-2xl font-semibold mt-8 mb-4\">Principle 4: But fundamentally it's about prioritisation</h2>\n\n<p class=\"mb-4 leading-relaxed text-gray-800\">Fundamentally, it is all about prioritisation. You cannot do everything. If you believe you can, you are not being ambitious enough. Which sounds like a contradiction — but you can always do more. Pick your sacrifice. What you choose not to do is as important as what you choose to do.</p>\n\n<h2 class=\"text-2xl font-semibold mt-8 mb-4\">Principle 5: Lean in to motivations</h2>\n\n<p class=\"mb-4 leading-relaxed text-gray-800\">Find what motivates you and lean into it. Avoiding possible nightmares can be as motivating as chasing dreams. Take advantage of all sources of motivation that you possibly can — common ones include: being competitive, caring for others, being creative, avoiding pain, and honouring contracts.</p>\n\n<h2 class=\"text-2xl font-semibold mt-8 mb-4\">Principle 6: It's about how you get up, not how you fall</h2>\n\n<p class=\"mb-4 leading-relaxed text-gray-800\">The fear of failure can be paralysing. Success is almost always the tip of the iceberg. If you have not failed often, you are probably under-performing — which sounds like a contradiction but is simply a reflection that you have been too conservative. Develop a relationship with failure — get to know intimately what it feels like so that you do not fear it. The best way to do this is to fail often in small ways.</p>\n\n<h2 class=\"text-2xl font-semibold mt-8 mb-4\">Principle 7: You are not your own master</h2>\n\n<p class=\"mb-4 leading-relaxed text-gray-800\">Understand that you cannot will yourself to do anything. The 'you' that plans is not the 'you' that executes. You have to work hard to understand the executer and what they are like in the moment. You ultimately have to negotiate with them. Be kind to them.</p>\n\n<h2 class=\"text-2xl font-semibold mt-8 mb-4\">Principle 8: Be flexible</h2>\n\n<p class=\"mb-4 leading-relaxed text-gray-800\">Things change continuously. You need to adapt. Accept that and learn to roll with the punches — wisely. <em>Be water, my friend.</em> The alternative is to be rigid and brittle — you'll survive for a while and then one day you'll break under the pressure.</p>\n\n<h2 class=\"text-2xl font-semibold mt-8 mb-4\">Principle 9: Continuous improvement</h2>\n\n<p class=\"mb-4 leading-relaxed text-gray-800\">Your work on productivity and getting the ultimate result is never done. You will need to continuously work on it for the rest of your life. CEOs with 40 years' experience struggle with it, as do new graduates — albeit with very different problems. You don't know what will work for you. And what's more, what does work will change over time. You should be constantly experimenting and updating how you approach work. Ideally, set time aside to do this.</p>\n\n<h2 class=\"text-2xl font-semibold mt-8 mb-4\">Principle 10: Say no</h2>\n\n<p class=\"mb-4 leading-relaxed text-gray-800\">Protect your time and productivity. Choose what you will not do (even which emails you will not respond to). And have the spine to stand by your decisions. This is one of the hardest things to achieve — especially if you value your relationships. You'll feel bad when you do it. People will criticise you for it. You must have confidence. </p>"},"__N_SSG":true}